open-vela/nuttx/arch/xtensa/src/esp32s3/esp32s3_cam_dvp.c
/****************************************************************************
 * arch/xtensa/src/esp32s3/esp32s3_cam_dvp.c
 *
 * ESP32-S3 LCD_CAM peripheral in CAM (input) mode: capture DVP 8-bit
 * parallel camera frames (OV3660 RGB565) via GDMA RX.
 *
 * Written NuttX-style, reusing the same GDMA + LCD_CAM infrastructure as
 * esp32s3_lcd.c (LCD is the same peripheral in output mode).
 *
 * Capture model (full-frame, modeled on IDF dvp_spi_lcd + esp_cam_ctlr_dvp):
 * - XMCLK(IO39) drives the sensor clock (board-layer LEDC, 20MHz)
 * - DMA RX chain covers one RGB565 frame (10 x 3840B desc = 38400B)
 * - cam_vs_eof_en = 1: VSYNC generates in_suc_eof = frame complete
 * - the GDMA EOF ISR re-arms the chain at every frame boundary (the
 * official start_trans() per-frame model): each DMA window is exactly
 * one frame, aligned to rxbuf[0] (this fixed the "pattern" misalignment)
 * - capture() masks the EOF IRQ, waits for the next EOF, freezes the
 * DMA and reads the stable frame; optional software RGB565 byte swap
 * (sensor sends high byte first, LVGL wants little-endian)
 * - GDMA RX channel IRQ (independent of LCD_CAM peripheral IRQ); the
 * LCD_CAM IRQ is used for the VSYNC frame-boundary counter (this
 * board's LCD is SPI-based, so ESP32S3_IRQ_LCD_CAM is free)
 *
 * [DIAG] Camera bring-up. Keep until capture is fully working.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <string.h>
#include <stdio.h>
#include <debug.h>

#include <nuttx/irq.h>
#include <nuttx/spinlock.h>
#include <nuttx/kmalloc.h>
#include <nuttx/arch.h>
#include <nuttx/sched.h>

#include "xtensa.h"
#include "esp32s3_gpio.h"
#include "esp32s3_dma.h"
#include "esp32s3_irq.h"
#include "esp32s3_spiram.h"
#include "hardware/esp32s3_soc.h"
#include "rom/cache.h"

/* 2026-09-09: ROM cache helper used by the I2S PSRAM DMA path; not declared
 * in the esp32s3 rom/cache.h header.
 */

extern int rom_cache_writeback_addr(uint32_t addr, uint32_t size)
  __asm__("rom_Cache_WriteBack_Addr");
extern int cache_invalidate_addr(uint32_t addr, uint32_t size)
  __asm__("Cache_Invalidate_Addr");
#include "hardware/esp32s3_system.h"
#include "hardware/esp32s3_lcd_cam.h"
#include "hardware/esp32s3_dma.h"

#ifdef CONFIG_ESP32S3_CAM_DVP

/****************************************************************************
 * Private Definitions
 ****************************************************************************/

/* DVP pin mapping (CHQ ESP32-S3-BOX V2.0, corrected 2026-08-28 to match
 * the WORKING IDF reference esp32-camera config):
 *   Y2=IO12 Y3=IO10 Y4=IO9 Y5=IO11 Y6=IO13 Y7=IO21 Y8=IO38 Y9=IO40
 *   PCLK=IO14 HREF=IO41 VSYNC=IO42 XMCLK=IO39
 * Y2..Y9 are the sensor's 8-bit data (D2..D9) and must land on
 * CAM_DATA_IN0..IN7 IN ORDER (Y2->bit0 ... Y9->bit7).  The old mapping
 * had Y2/Y4/Y5 swapped -> bit-scrambled bytes -> garbage colors.
 */

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define CAM_DVP_PCLK_PIN   14
#define CAM_DVP_HREF_PIN   41
#define CAM_DVP_VSYNC_PIN  42

/* CAM signal indices (soc/gpio_sig_map.h) */

#define SIG_CAM_PCLK       149   /* CAM_PCLK_IDX */
#define SIG_CAM_H_ENABLE   150   /* CAM_H_ENABLE_IDX (HREF) */
#define SIG_CAM_V_SYNC     152   /* CAM_V_SYNC_IDX (VSYNC) */

/* XMCLK: NOT configured here. The board layer (esp32s3_board_camera.c)
 * drives IO39 with LEDC PWM at 20MHz via board_camera_xmclk_init() (called
 * from board_camera_sccb_probe -> camera_init).
 */

/* Full-frame capture (vs_eof=1), one RGB565 160x120 frame per DMA window:
 * - descriptor chain covers exactly one frame (10 x 3840B desc,
 * line-aligned)
 * - cam_vs_eof_en = 1: VSYNC triggers in_suc_eof = frame complete
 * - GDMA EOF ISR re-arms the chain at every frame boundary (official
 * esp_cam_ctlr_dvp_start_trans() model)
 */

/* 2026-09-10: Frame size changed to [runtime selectable]: preview 160x120 /
 * capture 640x480. DMA links and dual PSRAM buffers are allocated based on
 * maximum frame size; when vs_eof_en=1, VSYNC serves as frame boundary.
 * boundary (EOF prematurely ends this transfer), so the chain being longer
 * than the current frame is harmless — DMA is not used at all gets
 * truncated by EOF. Switching modes only changes how many bytes the CPU
 * reads back (g_frame_size).
 */

#define CAM_FRAME_BPP     2
#define CAM_MAX_W         640
#define CAM_MAX_H         480
/* CAM_MAX_SIZE = 640 x 480 x 2 = 614400; CAM_LINE_BYTES = 640 x 2 = 1280.
 * CAM_RX_CHUNK is 3 lines at 640w / 12 lines at 160w (both 32-byte aligned).
 * CAM_RX_DESC_NUM >= ceil(614400 / 4032) = 153.
 */

#define CAM_MAX_SIZE      (CAM_MAX_W * CAM_MAX_H * CAM_FRAME_BPP)
#define CAM_LINE_BYTES    (CAM_MAX_W * CAM_FRAME_BPP)
#define CAM_RX_CHUNK      3840
#define CAM_RX_DESC_NUM   160
#define CAM_RX_BUF_SIZE   CAM_MAX_SIZE

/* AEC/AGC/AWB convergence warm-up frame count.
 *
 * Zenn's proof of root cause for 'NuttX ESP32-S3 camera all green': OV
 * series sensors' Auto-exposure/gain/white balance need **dozens of frames**
 * to converge. Cold frames (first few frames after STREAMON) will be "dark +
 * green tint". Official method = idle 24 frames to discard, then capture,
 * zero post-processing to achieve natural color. We tested that the G
 * channel slowly dropped from 50 to 42 (AWB still converging), whereas
 * capture only waits 2 frames to grab a frame → it always grabs a 'cold
 * frame'. OV3660 measured convergence is slower, warm-up takes 40 frames
 * (~1.2s @34FPS / ~2.3s @17.8FPS).
 */

#define CAM_WARMUP_FRAMES 40

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct esp32s3_cam_s
{
  int          dma_channel;          /* NuttX GDMA channel */
  bool         initialized;          /* init done once (idempotent) */
  bool         started;
  bool         warmed_up;            /* AEC/AWB warm-up done only once (reused for preview) */
  struct esp32s3_dmadesc_s dmadesc[CAM_RX_DESC_NUM];

  /* completed frames (ISR-only inc; vs_eof=1: one per VSYNC EOF) */

  volatile uint32_t block_done;
  volatile uint32_t vsync_count;     /* VSYNC pulses seen (LCD_CAM ISR) */
  volatile uint32_t frame_pending;   /* VSYNC seen since capture start */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct esp32s3_cam_s g_cam;

/* DMA RX + shadow buffers (38400B each) relocated to reserved top of PSRAM
 * since 2026-09-09. (esp32s3_psram_static_alloc), no longer occupying
 * internal DRAM: internal DRAM is occupied by WiFi (esp_wifi can only
 * allocate internally) can lead to ic_ebuf_alloc returning NULL when
 * combined with other static exhaustion, Data frame cannot be sent. The DMA
 * chain itself still uses internal descriptors; rxbuf/shadow data resides in
 * PSRAM Directly accessible via GDMA (consistent with I2S recording PSRAM
 * path); CPU reads back after cache operation. failure (cam_dvp_sync_rxbuf).
 * Allocation is done once in cam_dvp_dma_init().
 */

static uint8_t *g_cam_rxbuf;
static uint8_t *g_cam_shadow;

/* Preview stream mode switch: after esp32s3_cam_dvp_set_stream(true),
 * capture proceeds with rolling snapshots
 */

static bool g_stream_mode = false;
static bool g_stream_armed = false;
static uint8_t *g_last_frame = NULL;   /* get_frame returns frame: stream=shadow */

/* Software RGB565 byte swap, default ON.
 *
 * 2026-08-29 corrected (definitively, by sensor color bar): OV3660 RGB565
 * (0x4300=0x61) outputs BIG-ENDIAN (high byte first). PROOF = `plant cam
 * bar` (0x503D=0x80 standard 8-color bar): captured bars match [white yellow
 * cyan green magenta red blue black] ONLY in the byte-swapped (SWP) decode;
 * the little-endian decode is garbage. The earlier "LITTLE-ENDIAN"
 * conclusion (debug log 2.38) rested on ambiguous tests: a WHITE WALL is
 * 0xFFFF and a COVERED lens is ~0x0000 — both are byte-swap symmetric, and
 * contours only prove luminance structure, so neither could detect byte
 * order. The original datasheet reading "high byte first" (debug log 2.21)
 * was right all along. Toggle at runtime with `plant cam swap on|off`.
 */

static bool g_cam_byte_swap = true;

/* Silent mode (for preview): disables per-frame capture logging to avoid
 * screen flicker and slowdown.
 */

static bool g_cam_quiet = false;

