open-vela/nuttx/arch/xtensa/src/esp32s3/esp32s3_cam_dvp.c
/* Current frame geometry (runtime switch) */

static uint32_t g_frame_w = 160;
static uint32_t g_frame_h = 120;
static uint32_t g_frame_size = 160 * 120 * CAM_FRAME_BPP;

#define CAM_LOG(...) \
  do { if (!g_cam_quiet) printf(__VA_ARGS__); } while (0)

/****************************************************************************
 * Name: cam_dvp_sync_rxbuf
 *
 * Description:
 * The rxbuf on PSRAM is written directly by GDMA (bypassing CPU cache).
 * After DMA completes a frame,
 * CPU must invalidate that cache line before reading, otherwise CPU will
 * read stale cached data
 * (Same processing as I2S recording). Skipped when internal SRAM pointer is
 * used, behavior identical to original.
 ****************************************************************************/

static void cam_dvp_sync_rxbuf(void)
{
  if (esp32s3_ptr_extram(g_cam_rxbuf))
    {
      cache_invalidate_addr((uint32_t)g_cam_rxbuf, g_frame_size);
    }
}

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void cam_swap_rgb565(uint8_t *buf, size_t len)
{
  size_t i;

  for (i = 0; i + 1 < len; i += 2)
    {
      uint8_t t = buf[i];

      buf[i]     = buf[i + 1];
      buf[i + 1] = t;
    }
}

/* Print a few pixels at byte offset `off` decoded BOTH ways as RGB565:
 * [raw_le ...] = interpretation WITHOUT swap (wrong for OV3660: it is
 * BIG-ENDIAN, high byte first — see 2.49 color bar proof) [swp ...] =
 * interpretation WITH swap (CORRECT) White bar: swp should be near-white.
 */

static void cam_diag_pixels(const uint8_t *fp, int off)
{
  int p;
  int row = off / CAM_LINE_BYTES;

  printf("[Cam-DVP] row %d @%d:", row, off);
  for (p = 0; p < 4; p++)
    {
      uint16_t raw_le = fp[off + p * 2] |
                        (uint16_t)(fp[off + p * 2 + 1] << 8);
      uint16_t swp    = fp[off + p * 2 + 1] |
                        (uint16_t)(fp[off + p * 2] << 8);

      printf(" [%04x|%04x r%02u g%02u b%02u | r%02u g%02u b%02u]",
             raw_le, swp,
             (raw_le >> 11) & 0x1f, (raw_le >> 5) & 0x3f, raw_le & 0x1f,
             (swp >> 11) & 0x1f, (swp >> 5) & 0x3f, swp & 0x1f);
    }

  printf("\n");
}

static inline uint32_t cam_dvp_getreg(uint32_t reg)
{
  return getreg32(reg);
}

static inline void cam_dvp_putreg(uint32_t reg, uint32_t val)
{
  putreg32(val, reg);
}

/* Per-channel GDMA register accessor (register sets are 0xC8 apart). */

static uint32_t cam_gdma_reg(uint32_t base_ch0, int ch)
{
  return base_ch0 + (uint32_t)ch * GDMA_REG_OFFSET;
}

/****************************************************************************
 * Name: cam_dvp_gpio_config
 *
 * XMCLK(IO39) is driven by the board layer via LEDC PWM 20MHz
 * (board_camera_xmclk_init, called from camera_init -> probe).  We must
 * NOT touch IO39 here, otherwise the sensor clock dies.
 ****************************************************************************/

static void cam_dvp_gpio_config(void)
{
  /* DVP data pins -> CAM_DATA_IN0..IN7.
   *
   * IMPORTANT (2026-08-28): mapping corrected to match the WORKING IDF
   * reference (esp32s3/plant-companion/components/camera_capture/):
   * pin_d0=12 pin_d1=10 pin_d2=9 pin_d3=11 pin_d4=13 pin_d5=21 pin_d6=38
   * pin_d7=40 (esp32-camera pin_dN -> CAM_DATA_INN) i.e. sensor
   * D2(Y2)->bit0, D3(Y3)->bit1, D4(Y4)->bit2, D5(Y5)->bit3, D6(Y6)->bit4,
   * D7(Y7)->bit5, D8(Y8)->bit6, D9(Y9)->bit7. The previous mapping fed
   * D2/D4/D5 to the wrong bit positions -> every received byte was
   * bit-scrambled -> RGB565 colors were garbage while pure-white pixels
   * (all-1 bits) still survived as 0xFFFF (the "ff ff" frames we saw) and
   * dark pixels stayed ~0. That exactly matches the observed "colorful
   * chaos" that no register fix could cure.
   */

  /* Y2 (sensor D2) -> CAM_DATA_IN0_IDX (bit 0) */

  esp32s3_configgpio(12, INPUT);
  esp32s3_gpio_matrix_in(12, 133, 0);

  /* Y3 (sensor D3) -> CAM_DATA_IN1_IDX (bit 1) */

  esp32s3_configgpio(10, INPUT);
  esp32s3_gpio_matrix_in(10, 134, 0);

  /* Y4 (sensor D4) -> CAM_DATA_IN2_IDX (bit 2) */

  esp32s3_configgpio(9, INPUT);
  esp32s3_gpio_matrix_in(9, 135, 0);

  /* Y5 (sensor D5) -> CAM_DATA_IN3_IDX (bit 3) */

  esp32s3_configgpio(11, INPUT);
  esp32s3_gpio_matrix_in(11, 136, 0);

  /* Y6 (sensor D6) -> CAM_DATA_IN4_IDX (bit 4) */

  esp32s3_configgpio(13, INPUT);
  esp32s3_gpio_matrix_in(13, 137, 0);

  /* Y7 (sensor D7) -> CAM_DATA_IN5_IDX (bit 5) */

  esp32s3_configgpio(21, INPUT);
  esp32s3_gpio_matrix_in(21, 138, 0);

  /* Y8 (sensor D8) -> CAM_DATA_IN6_IDX (bit 6) */

  esp32s3_configgpio(38, INPUT);
  esp32s3_gpio_matrix_in(38, 139, 0);

  /* Y9 (sensor D9) -> CAM_DATA_IN7_IDX (bit 7) */

  esp32s3_configgpio(40, INPUT);
  esp32s3_gpio_matrix_in(40, 140, 0);

  esp32s3_configgpio(CAM_DVP_PCLK_PIN, INPUT);
  esp32s3_gpio_matrix_in(CAM_DVP_PCLK_PIN, SIG_CAM_PCLK, 0);

  esp32s3_configgpio(CAM_DVP_HREF_PIN, INPUT);
  esp32s3_gpio_matrix_in(CAM_DVP_HREF_PIN, SIG_CAM_H_ENABLE, 0);

  esp32s3_configgpio(CAM_DVP_VSYNC_PIN, INPUT);
  esp32s3_gpio_matrix_in(CAM_DVP_VSYNC_PIN, SIG_CAM_V_SYNC, 1);

  /* XMCLK(IO39) is NOT touched here: board layer drives it with LEDC PWM
   * 20MHz (board_camera_xmclk_init via camera_init/probe).
   *
   * VSYNC inverted (last arg = 1): esp32-camera cam_init() sets
   * cam_obj->vsync_invert = true; OV3660 drives VSYNC low during the active
   * frame, inverting aligns CAM EOF with the real frame start.
   */

  lcdinfo("DVP pins routed to LCD_CAM CAM input (XMCLK=IO39 via LEDC)\n");
}

/****************************************************************************
 * Name: cam_dvp_hw_init
 ****************************************************************************/

static void cam_dvp_hw_init(void)
{
  uint32_t regval;

  /* Enable LCD_CAM peripheral clock DIRECTLY via SYSTEM register. This
   * board's LCD uses SPI (CONFIG_ESP32S3_LCD=n) so esp32s3_lcd.c is not
   * compiled and nobody enables the LCD_CAM clock. We bypass
   * periph_module_enable() (its spinlock path is suspect in this build) and
   * set the clock-enable + clear-reset bits directly.
   */

  modifyreg32(SYSTEM_PERIP_CLK_EN1_REG, 0, SYSTEM_LCD_CAM_CLK_EN);
  modifyreg32(SYSTEM_PERIP_RST_EN1_REG, SYSTEM_LCD_CAM_RST, 0);

  /* Whole-register reset, exactly like IDF ll_cam_config():
   * LCD_CAM.cam_ctrl.val = 0; LCD_CAM.cam_ctrl1.val = 0;
   * LCD_CAM.cam_rgb_yuv.val = 0; This avoids stale bits (e.g. cam_start,
   * bytelen) left by previous read-modify-write passes.
   */

  cam_dvp_putreg(LCD_CAM_CAM_CTRL_REG, 0);
  cam_dvp_putreg(LCD_CAM_CAM_CTRL1_REG, 0);
  cam_dvp_putreg(LCD_CAM_CAM_RGB_YUV_REG, 0);

  /* cam_ctrl (IDF order):
   *   cam_clkm_div_b/a = 0
   *   cam_clkm_div_num = 160M / 20M = 8   (xclk = PLL160M/8)
   *   cam_clk_sel      = 3                (PLL160M source)
   *   cam_stop_en      = 0
   *   cam_vsync_filter_thres = 4
   *   cam_update       = 0 (armed later in start)
   *   cam_byte_order   = 0, cam_bit_order = 0
   *   cam_line_int_en  = 0
   *   cam_vs_eof_en    = 0  (EOF by cam_rec_data_bytelen, like esp32-camera
   *                          ll_cam_config.  vs_eof=1 fires mid-frame,
   *                          data starts at wrong offset -> looked like
   *                          a byte-order bug!)
   */

  regval = 0;
  regval |= (8 << LCD_CAM_CAM_CLKM_DIV_NUM_S);   /* 160M/8 = 20M XMCLK */
  regval |= (3 << LCD_CAM_CAM_CLK_SEL_S);        /* PLL160M */
  regval |= (4 << LCD_CAM_CAM_VSYNC_FILTER_THRES_S);
  /* vs_eof=1: VSYNC EOF = frame complete (official dvp_spi_lcd cam_hal_init:
   * cam_ll_enable_vsync_generate _eof(hw,1))
   */

