open-vela/nuttx/arch/xtensa/src/esp32s3/esp32s3_cam_dvp.c
  regval |= (1 << LCD_CAM_CAM_VS_EOF_EN_S);
  /* cam_byte_order=0: official rejects byte swap for 8-bit data ("byte swap
   * is not supported when cam_data_width is 8")
   */

  cam_dvp_putreg(LCD_CAM_CAM_CTRL_REG, regval);

  /* cam_ctrl1 (IDF order):
   *   cam_rec_data_bytelen = 3839 (compat only; vs_eof=1 makes VSYNC the
   *                                           EOF source)
   *   cam_line_int_num = 0
   *   cam_clk_inv = 0 (PCLK not inverted)
   *   cam_vsync_filter_en = 1
   *   cam_2byte_en = 0 (8-bit data)
   *   cam_de_inv / hsync_inv / vsync_inv = 0
   *   cam_vh_de_mode_en = 0
   */

  regval = 0;
  regval |= ((CAM_RX_CHUNK - 1) << LCD_CAM_CAM_REC_DATA_BYTELEN_S);
  regval |= (1 << LCD_CAM_CAM_VSYNC_FILTER_EN_S);
  cam_dvp_putreg(LCD_CAM_CAM_CTRL1_REG, regval);

  printf("[Cam-DVP] CAM hw configured (8-bit DVP, PLL160M/8, "
         "vs_eof=1, bytelen=%d compat)\n", CAM_RX_CHUNK - 1);
}

/****************************************************************************
 * Name: cam_dvp_dma_init
 ****************************************************************************/

static int cam_dvp_dma_init(void)
{
  struct esp32s3_cam_s *priv = &g_cam;

  /* burst=true -> esp32s3_dma_setup() uses ESP32S3_DMA_BUFLEN_MAX_4B_ALIGNED
   * (4092) per descriptor, exactly matching LCD_CAM_DMA_NODE_BUFFER_MAX_SIZE
   * in IDF's esp32-camera. With burst=false the descriptor would be 4095
   * bytes while bytelen is 4091 -> EOF lands 3 bytes early, corrupting the
   * stream.
   */

  priv->dma_channel = esp32s3_dma_request(ESP32S3_DMA_PERIPH_LCDCAM,
                                          10, 1, true);
  if (priv->dma_channel < 0)
    {
      printf("[Cam-DVP] GDMA RX alloc FAILED\n");
      return -ENODEV;
    }

  printf("[Cam-DVP] dma_channel=%d\n", priv->dma_channel);

#ifdef CONFIG_ESP32S3_SPIRAM_COMMON_HEAP
  g_cam_rxbuf = esp32s3_psram_static_alloc(CAM_RX_BUF_SIZE);
  g_cam_shadow = esp32s3_psram_static_alloc(CAM_MAX_SIZE);
#else
  static uint8_t rxbuf_fallback[CAM_RX_BUF_SIZE]
    __attribute__((aligned(64)));
  static uint8_t shadow_fallback[160 * 120 * CAM_FRAME_BPP]
    __attribute__((aligned(64)));

  g_cam_rxbuf = rxbuf_fallback;
  g_cam_shadow = shadow_fallback;
#endif
  if (g_cam_rxbuf == NULL || g_cam_shadow == NULL)
    {
      printf("[Cam-DVP] psram carve alloc FAILED\n");
      return -ENOMEM;
    }

  printf("[Cam-DVP] rxbuf=%p size=%u (psram carve)\n",
         g_cam_rxbuf, CAM_RX_BUF_SIZE);
  memset(g_cam_rxbuf, 0, CAM_RX_BUF_SIZE);
  if (esp32s3_ptr_extram(g_cam_rxbuf))
    {
      rom_cache_writeback_addr((uint32_t)g_cam_rxbuf, CAM_RX_BUF_SIZE);
    }

  printf("[Cam-DVP] dma_setup call (%u desc x %uB)...\n",
         CAM_RX_DESC_NUM, CAM_RX_CHUNK);
  esp32s3_dma_setup(priv->dmadesc, CAM_RX_DESC_NUM,
                    g_cam_rxbuf, CAM_RX_BUF_SIZE,
                    false, priv->dma_channel);

  /* Linear chain (official dvp_spi_lcd + esp_cam_ctlr_dvp): the GDMA EOF ISR
   * re-loads the chain at every frame boundary (per-frame start), so the DMA
   * always captures exactly one frame per VSYNC window.
   */

  printf("[Cam-DVP] dma_setup done (linear chain, ISR re-arm per frame)\n");

  return OK;
}

/****************************************************************************
 * Name: cam_dvp_gdma_isr
 *
 * GDMA RX channel interrupt: in_suc_eof fires once per frame (vs_eof=1,
 * VSYNC-driven). ISR does NOT touch NuttX semaphores/syslog (IRAM-safe):
 * it increments a volatile counter and RE-ARMS the DMA chain at the frame
 * boundary, exactly like the official driver's per-frame start_trans().
 *
 * Re-arm is DMA-only (stop -> in_rst -> reload link -> start), inline
 * register writes so the ISR stays IRAM-safe. We deliberately do NOT
 * pulse cam_reset / cam_afifo_reset here: cam_reset would clear the
 * LCD_CAM INT_ENA (debug log 2.29) and afifo_reset would drop FIFO
 * continuity; the CAM peripheral keeps streaming on its own once started.
 *
 * This per-frame re-arm is the key fix for the "garbled colors" (garbled
 * colors):
 * previously the chain was only re-armed from capture() at an arbitrary
 * phase, so the DMA window [arm -> next VSYNC] was a partial frame that
 * changed every capture. Re-arming at every VSYNC EOF makes each window
 * exactly one frame, aligned to the frame start.
 ****************************************************************************/

static int IRAM_ATTR cam_dvp_gdma_isr(int irq, void *context, void *arg)
{
  struct esp32s3_cam_s *priv = &g_cam;
  int ch = priv->dma_channel;
  uint32_t st;
  uint32_t regval;

  st = cam_dvp_getreg(cam_gdma_reg(DMA_IN_INT_ST_CH0_REG, ch));
  if (st != 0)
    {
      cam_dvp_putreg(cam_gdma_reg(DMA_IN_INT_CLR_CH0_REG, ch), st);
    }

  if (st & DMA_IN_SUC_EOF_CH0_INT_ST_M)
    {
      priv->block_done++;

      /* 1. stop DMA RX (self-clearing bit) */

      regval = cam_dvp_getreg(cam_gdma_reg(DMA_IN_LINK_CH0_REG, ch));
      regval |= DMA_INLINK_STOP_CH0_M;
      cam_dvp_putreg(cam_gdma_reg(DMA_IN_LINK_CH0_REG, ch), regval);

      /* 2. reset RX FSM + FIFO pointer (in_rst pulse) */

      regval = cam_dvp_getreg(cam_gdma_reg(DMA_IN_CONF0_CH0_REG, ch));
      regval |= DMA_IN_RST_CH0_M;
      cam_dvp_putreg(cam_gdma_reg(DMA_IN_CONF0_CH0_REG, ch), regval);
      regval &= ~DMA_IN_RST_CH0_M;
      cam_dvp_putreg(cam_gdma_reg(DMA_IN_CONF0_CH0_REG, ch), regval);

      /* 3. reload the descriptor link base (preserve other LINK bits) */

      regval = cam_dvp_getreg(cam_gdma_reg(DMA_IN_LINK_CH0_REG, ch));
      regval &= ~DMA_INLINK_ADDR_CH0;
      regval |= (uint32_t)priv->dmadesc & DMA_INLINK_ADDR_CH0;
      cam_dvp_putreg(cam_gdma_reg(DMA_IN_LINK_CH0_REG, ch), regval);

      /* 4. start RX again */

      regval = cam_dvp_getreg(cam_gdma_reg(DMA_IN_LINK_CH0_REG, ch));
      regval |= DMA_INLINK_START_CH0_M;
      cam_dvp_putreg(cam_gdma_reg(DMA_IN_LINK_CH0_REG, ch), regval);
    }

  return 0;
}

/****************************************************************************
 * Name: cam_dvp_vsync_isr
 *
 * LCD_CAM peripheral interrupt: cam_vsync marks frame boundaries.  With
 * vs_eof=0 the DMA EOF is data-driven (every 3840B) and does NOT align
 * to frames - without a VSYNC marker, a 38400B collection can span two
 * frames -> horizontal banding.  ISR only clears the flag and counts.
 ****************************************************************************/

static int IRAM_ATTR cam_dvp_vsync_isr(int irq, void *context, void *arg)
{
  struct esp32s3_cam_s *priv = &g_cam;
  uint32_t st;

