open-vela/nuttx/arch/xtensa/src/esp32s3/esp32s3_cam_dvp.c
  st = cam_dvp_getreg(LCD_CAM_LC_DMA_INT_ST_REG);
  if (st & LCD_CAM_CAM_VSYNC_INT_ST_M)
    {
      cam_dvp_putreg(LCD_CAM_LC_DMA_INT_CLR_REG,
                     LCD_CAM_CAM_VSYNC_INT_ST_M);
      priv->vsync_count++;
      priv->frame_pending = 1;
    }

  return 0;
}

/****************************************************************************
 * Name: cam_dvp_arm
 *
 * Re-arm the DMA chain + CAM start.  Follows esp32-camera ll_cam_start()
 * exactly (IDF-proven sequence).  Called on first start and after every
 * completed frame (per-frame re-arm, like the dvp_spi_lcd example).
 ****************************************************************************/

static void cam_dvp_arm(void)
{
  struct esp32s3_cam_s *priv = &g_cam;
  uint32_t regval;

  /* 1. cam_start = 0 (clear leftover start bit) */

  regval = cam_dvp_getreg(LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_START_M;
  cam_dvp_putreg(LCD_CAM_CAM_CTRL1_REG, regval);

  /* 2. CAM + AFIFO reset pulses (WO bits) */

  regval = cam_dvp_getreg(LCD_CAM_CAM_CTRL1_REG);
  regval |= LCD_CAM_CAM_RESET_M;
  cam_dvp_putreg(LCD_CAM_CAM_CTRL1_REG, regval);
  regval &= ~LCD_CAM_CAM_RESET_M;
  cam_dvp_putreg(LCD_CAM_CAM_CTRL1_REG, regval);

  regval |= LCD_CAM_CAM_AFIFO_RESET_M;
  cam_dvp_putreg(LCD_CAM_CAM_CTRL1_REG, regval);
  regval &= ~LCD_CAM_CAM_AFIFO_RESET_M;
  cam_dvp_putreg(LCD_CAM_CAM_CTRL1_REG, regval);

  /* 3. Set bytelen (kept for compatibility; EOF driven by VSYNC) */

  regval = cam_dvp_getreg(LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_REC_DATA_BYTELEN_M;
  regval |= ((CAM_RX_CHUNK - 1) << LCD_CAM_CAM_REC_DATA_BYTELEN_S);
  cam_dvp_putreg(LCD_CAM_CAM_CTRL1_REG, regval);

  /* 4. Load chain (in_rst pulse + link addr) and start DMA (link start) */

  esp32s3_dma_load(priv->dmadesc, priv->dma_channel, false);
  esp32s3_dma_enable(priv->dma_channel, false);

  /* 5. cam_ctrl.cam_update = 1 (update lives in cam_ctrl) */

  regval = cam_dvp_getreg(LCD_CAM_CAM_CTRL_REG);
  regval |= LCD_CAM_CAM_UPDATE_REG_M;
  cam_dvp_putreg(LCD_CAM_CAM_CTRL_REG, regval);

  /* 6. cam_ctrl1.cam_start = 1 */

  regval = cam_dvp_getreg(LCD_CAM_CAM_CTRL1_REG);
  regval |= LCD_CAM_CAM_START_M;
  cam_dvp_putreg(LCD_CAM_CAM_CTRL1_REG, regval);
}

/****************************************************************************
 * Name: cam_dvp_enable_ints
 *
 * Re-enable the two capture interrupts.  cam_dvp_arm() pulses cam_reset,
 * which resets the whole LCD_CAM peripheral and therefore clears
 * LC_DMA_INT_ENA (debug log 2.29) — call this after every cam_dvp_arm().
 ****************************************************************************/

static void cam_dvp_enable_ints(void)
{
  struct esp32s3_cam_s *priv = &g_cam;
  uint32_t regval;

  /* GDMA RX in_suc_eof interrupt (per-frame re-arm driver) */

  regval = cam_dvp_getreg(cam_gdma_reg(DMA_IN_INT_ENA_CH0_REG,
                                       priv->dma_channel));
  regval |= DMA_IN_SUC_EOF_CH0_INT_ENA_M;
  cam_dvp_putreg(cam_gdma_reg(DMA_IN_INT_ENA_CH0_REG, priv->dma_channel),
                 regval);

  /* LCD_CAM cam_vsync interrupt (frame boundary diagnostics) */

  regval = cam_dvp_getreg(LCD_CAM_LC_DMA_INT_ENA_REG);
  regval |= LCD_CAM_CAM_VSYNC_INT_ENA_M;
  cam_dvp_putreg(LCD_CAM_LC_DMA_INT_ENA_REG, regval);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int esp32s3_cam_dvp_init(void)
{
  struct esp32s3_cam_s *priv = &g_cam;
  uint32_t regval;
  int ret;

  /* Idempotent: only initialize once. Repeated calls (e.g. each
   * camera_capture_frame) must NOT re-request DMA channels or re-memalign
   * the frame buffer - that leaks channels/memory.
   */

  if (priv->initialized)
    {
      return OK;
    }

  memset(priv, 0, sizeof(*priv));

  cam_dvp_gpio_config();
  cam_dvp_hw_init();

  ret = cam_dvp_dma_init();
  if (ret < 0)
    {
      return ret;
    }

  /* GDMA RX channel interrupt only (peripheral IRQ 66 + chan). LCD_CAM
   * peripheral IRQ is NOT used -> no conflict with LCD driver. Must map the
   * peripheral IRQ (esp32s3_setup_irq) BEFORE irq_attach + up_enable_irq,
   * otherwise g_irqmap[irq] is IRQ_UNMAPPED and up_enable_irq writes a
   * garbage CPUINT -> hangs.
   */

  printf("[Cam-DVP] setup_irq call (periph=%d)...\n",
         ESP32S3_PERIPH_DMA_IN_CH0 + priv->dma_channel);
  esp32s3_setup_irq(this_cpu(),
                    ESP32S3_PERIPH_DMA_IN_CH0 + priv->dma_channel,
                    ESP32S3_INT_PRIO_DEF,
                    ESP32S3_CPUINT_LEVEL);
  printf("[Cam-DVP] setup_irq done\n");

  printf("[Cam-DVP] irq_attach call (irq=%d)...\n",
         ESP32S3_IRQ_DMA_IN_CH0 + priv->dma_channel);
  ret = irq_attach(ESP32S3_IRQ_DMA_IN_CH0 + priv->dma_channel,
                   cam_dvp_gdma_isr, NULL);
  printf("[Cam-DVP] irq_attach done (ret=%d)\n", ret);
  if (ret < 0)
    {
      printf("[Cam-DVP] gdma irq attach FAILED (%d)\n", ret);
      return ret;
    }

  up_enable_irq(ESP32S3_IRQ_DMA_IN_CH0 + priv->dma_channel);
  printf("[Cam-DVP] irq enabled\n");

  /* Enable GDMA in_suc_eof interrupt */

  regval = cam_dvp_getreg(cam_gdma_reg(DMA_IN_INT_ENA_CH0_REG,
                                       priv->dma_channel));
  regval |= DMA_IN_SUC_EOF_CH0_INT_ENA_M;
  cam_dvp_putreg(cam_gdma_reg(DMA_IN_INT_ENA_CH0_REG, priv->dma_channel),
                 regval);

  printf("[Cam-DVP] init done: irq=%d\n",
         ESP32S3_IRQ_DMA_IN_CH0 + priv->dma_channel);

  /* LCD_CAM peripheral VSYNC interrupt: marks frame boundaries (needed
   * because vs_eof=0 DMA EOFs are data-driven, not frame-aligned).
   * esp32s3_lcd.c is NOT compiled (CONFIG_ESP32S3_LCD=n) so this IRQ is
   * free.
   */

  printf("[Cam-DVP] vsync irq setup (periph=%d)...\n",
         ESP32S3_PERIPH_LCD_CAM);
  esp32s3_setup_irq(this_cpu(),
                    ESP32S3_PERIPH_LCD_CAM,
                    ESP32S3_INT_PRIO_DEF,
                    ESP32S3_CPUINT_LEVEL);
  ret = irq_attach(ESP32S3_IRQ_LCD_CAM, cam_dvp_vsync_isr, NULL);
  printf("[Cam-DVP] vsync irq_attach done (ret=%d)\n", ret);
  if (ret < 0)
    {
      printf("[Cam-DVP] vsync irq attach FAILED (%d)\n", ret);
      return ret;
    }

  up_enable_irq(ESP32S3_IRQ_LCD_CAM);

