open-vela/nuttx/arch/xtensa/src/esp32s3/esp32s3_cam_dvp.c
  /* Enable cam_vsync interrupt in LCD_CAM */

  regval = cam_dvp_getreg(LCD_CAM_LC_DMA_INT_ENA_REG);
  regval |= LCD_CAM_CAM_VSYNC_INT_ENA_M;
  cam_dvp_putreg(LCD_CAM_LC_DMA_INT_ENA_REG, regval);
  printf("[Cam-DVP] vsync irq enabled\n");

  priv->initialized = true;
  lcdinfo("cam_dvp: DVP capture initialized\n");

  return OK;
}

int esp32s3_cam_dvp_start(void)
{
  struct esp32s3_cam_s *priv = &g_cam;

  /* 2026-09-18: Before each stream start, reclaim DVP pins from UART0.
   *
   * When leaving capture page, apps side calls esp32s3_uart0_reclaim_pins()
   * to reclaim IO42(TX)/IO40(RX) returned to UART0 (needed for soil sensor),
   * and esp32s3_cam_dvp_init() carries the initialized guard, won't run
   * cam_dvp_gpio_config() again when entering the photo page the second
   * time. As a result: the second time and Previously, entering the photo
   * capture page, VSYNC(IO42) was constantly held by UART0's TX, preventing
   * detection of frame boundaries, capture waits 10-second timeout, preview
   * thread exits, viewfinder goes blank, only rebooting board can
   * restoration (user feedback: "works initially after restart, fails after
   * running for a while").
   *
   * GPIO matrix is last-writer-wins, rerouting once here is sufficient; only
   * touches pins, Does not disturb DMA or interrupts, can be safely called
   * repeatedly.
   */

  cam_dvp_gpio_config();

  if (priv->started)
    {
      return OK;
    }

  /* arm the DMA chain + CAM once (full start sequence); cam_reset inside arm
   * clears the INT_ENAs, so re-enable both interrupts afterwards
   */

  cam_dvp_arm();
  cam_dvp_enable_ints();

  priv->started = true;
  printf("[Cam-DVP] capture started\n");

  return OK;
}

int esp32s3_cam_dvp_stop(void)
{
  struct esp32s3_cam_s *priv = &g_cam;
  uint32_t regval;

  if (!priv->started)
    {
      return OK;
    }

  /* Mask the GDMA EOF interrupt first: the ISR re-arms the chain at every
   * frame boundary and would otherwise restart a disabled DMA.
   */

  regval = cam_dvp_getreg(cam_gdma_reg(DMA_IN_INT_ENA_CH0_REG,
                                       priv->dma_channel));
  regval &= ~DMA_IN_SUC_EOF_CH0_INT_ENA_M;
  cam_dvp_putreg(cam_gdma_reg(DMA_IN_INT_ENA_CH0_REG, priv->dma_channel),
                 regval);

  /* cam_ll_stop(): cam_ctrl1.cam_start = 0; cam_ctrl.cam_update = 1 */

  regval = cam_dvp_getreg(LCD_CAM_CAM_CTRL1_REG);
  regval &= ~LCD_CAM_CAM_START_M;
  cam_dvp_putreg(LCD_CAM_CAM_CTRL1_REG, regval);

  regval = cam_dvp_getreg(LCD_CAM_CAM_CTRL_REG);
  regval |= LCD_CAM_CAM_UPDATE_REG_M;
  cam_dvp_putreg(LCD_CAM_CAM_CTRL_REG, regval);

  esp32s3_dma_disable(priv->dma_channel, false);
  priv->started = false;
  g_stream_armed = false;

  lcdinfo("cam_dvp: capture stopped\n");

  return OK;
}

/****************************************************************************
 * Name: esp32s3_cam_dvp_capture
 *
 * Capture one complete RGB565 frame (vs_eof=1: VSYNC-driven EOF = frame
 * complete).  The GDMA ISR re-arms the chain at every frame boundary, so
 * the DMA always captures exactly one aligned frame per VSYNC.
 *
 * Flow:
 *   1. align  — wait for one EOF with the ISR active (guarantees the DMA
 *               is mid-capture of a complete frame when we mask below)
 *   2. mask   — disable the GDMA EOF interrupt + clear pending bits, so
 *               the ISR cannot re-arm (and overwrite) the frame we read
 *   3. wait   — for the next (post-mask) EOF; the DMA stops at this frame
 *               boundary with one complete frame in rxbuf
 *   4. freeze — esp32s3_dma_disable (already stopped at EOF, safety)
 *   5. sink   — optional RGB565 byte swap, then hand frame to the sink
 *   6. re-arm — cam_dvp_arm() + re-enable both interrupts for next capture
 *
 * Input Parameters:
 *   sink     - frame callback (called once with g_frame_size bytes)
 *   sink_arg - opaque arg passed to sink
 *   eoi_out  - set to true when the frame is delivered (may be NULL)
 *
 * Returned Value: g_frame_size on success; negated errno on failure.
 ****************************************************************************/

int esp32s3_cam_dvp_capture(void (*sink)(const uint8_t *data, size_t len,
                                          void *arg),
                            void *sink_arg,
                            volatile bool *eoi_out)
{
  struct esp32s3_cam_s *priv = &g_cam;
  int ch = priv->dma_channel;
  irqstate_t flags;
  uint32_t seen;
  uint32_t stall = 0;
  uint32_t regval;
  uint32_t raww;

  if (sink == NULL && eoi_out == NULL)
    {
      return -EINVAL;
    }

  CAM_LOG("[Cam-DVP] capture enter (vs_eof=1): block_done=%u vsync=%u\n",
          priv->block_done, priv->vsync_count);

  /* Warm-up (first time only): AEC/AGC/AWB needs dozens of frames to
   * converge. DMA must keep running, During warm-up, ISR continuously
   * re-arms, rxbuf gets overwritten (we read only during frame capture).
   * warm-up only occurs during the first capture — continuous preview
   * reuses the converged state.
   */

  if (!priv->warmed_up)
    {
      cam_dvp_arm();
      cam_dvp_enable_ints();
      g_stream_armed = true;

        {
          int w;

          for (w = 0; w < CAM_WARMUP_FRAMES; w++)
            {
              seen = priv->block_done;
              stall = 0;
              while (priv->block_done == seen)
                {
                  up_udelay(2000);
                  stall++;
                  if (stall > 5000)
                    {
                      CAM_LOG("[Cam-DVP] warmup timeout\n");
                      return -ETIMEDOUT;
                    }
                }
            }
        }

      priv->warmed_up = true;
      CAM_LOG("[Cam-DVP] warmup done (%d frames, AEC converged)\n",
              CAM_WARMUP_FRAMES);
    }

  /* Preview stream mode: rolling capture + snapshot. Wait for the next EOF
   * (frame just completed), immediately rxbuf copied to shadow (and
   * byte-swapped on shadow), DMA does not stop, ISR continuous re-arming —
   * next capture requires no re-arm/realignment, only waiting for one frame
   * period; When LCD reads shadow, DMA is writing rxbuf, no interference, no
   * tearing.
   */

  if (g_stream_mode)
    {
      if (!g_stream_armed)
        {
          cam_dvp_arm();
          cam_dvp_enable_ints();
          g_stream_armed = true;

          /* The first window after arming is a half-frame: digest one EOF
           * first, then all subsequent are full frames
           */

          seen = priv->block_done;
          stall = 0;
          while (priv->block_done == seen)
            {
              up_udelay(2000);
              stall++;
              if (stall > 5000)
                {
                  CAM_LOG("[Cam-DVP] stream arm align timeout\n");
                  return -ETIMEDOUT;
                }
            }
        }

      seen = priv->block_done;
      stall = 0;
      while (priv->block_done == seen)
        {
          up_udelay(150);
          stall++;
          if ((stall % 2000) == 0)
            {
              CAM_LOG("[Cam-DVP] stream frame wait... stall=%u\n", stall);
            }

