open-vela/nuttx/arch/xtensa/src/esp32s3/esp32s3_cam_dvp.c
          if (stall > 80000)
            {
              CAM_LOG("[Cam-DVP] stream frame timeout\n");
              return -ETIMEDOUT;
            }
        }

      cam_dvp_sync_rxbuf();
      memcpy(g_cam_shadow, g_cam_rxbuf, g_frame_size);
      if (g_cam_byte_swap)
        {
          cam_swap_rgb565(g_cam_shadow, g_frame_size);
        }

      g_last_frame = g_cam_shadow;

      if (eoi_out != NULL)
        {
          *eoi_out = true;
        }

      CAM_LOG("[Cam-DVP] stream frame done: %u bytes\n",
              (unsigned)g_frame_size);
      return (int)g_frame_size;
    }

  /* === Freeze mode (capture/colorbars/single frame): stops DMA after
   * grabbing, ensures frame stability ===
   */

  if (!g_stream_armed)
    {
      cam_dvp_arm();
      cam_dvp_enable_ints();
      g_stream_armed = true;

      /* First window after arm is half-frame: waiting for its self-healing
       * EOF (alignment)
       */

      seen = priv->block_done;
      stall = 0;
      while (priv->block_done == seen)
        {
          up_udelay(2000);
          stall++;
          if ((stall % 500) == 0)
            {
              CAM_LOG("[Cam-DVP] align wait... stall=%u\n", stall);
            }

          if (stall > 5000)
            {
              CAM_LOG("[Cam-DVP] align timeout, no EOF\n");
              return -ETIMEDOUT;
            }
        }

      CAM_LOG("[Cam-DVP] aligned (block_done=%u)\n", priv->block_done);
    }

  /* 2. Mask the GDMA EOF interrupt and clear any pending EOF, so no ISR
   * re-arm can overwrite the frame while we read it.
   */

  flags = enter_critical_section();

  regval = cam_dvp_getreg(cam_gdma_reg(DMA_IN_INT_ENA_CH0_REG, ch));
  regval &= ~DMA_IN_SUC_EOF_CH0_INT_ENA_M;
  cam_dvp_putreg(cam_gdma_reg(DMA_IN_INT_ENA_CH0_REG, ch), regval);

  cam_dvp_putreg(cam_gdma_reg(DMA_IN_INT_CLR_CH0_REG, ch),
                 DMA_IN_SUC_EOF_CH0_INT_ST_M);

  leave_critical_section(flags);

  /* 3. Wait for the NEXT (post-mask) EOF: the DMA stops at this frame
   * boundary with one complete frame in rxbuf (it was capturing from the
   * last ISR re-arm at the previous boundary).
   */

  stall = 0;
  for (; ; )
    {
      raww = cam_dvp_getreg(cam_gdma_reg(DMA_IN_INT_RAW_CH0_REG, ch));
      if (raww & DMA_IN_SUC_EOF_CH0_INT_ST_M)
        {
          break;
        }

      up_udelay(2000);
      stall++;
      if ((stall % 500) == 0)
        {
          CAM_LOG("[Cam-DVP] waiting frame EOF... stall=%u\n", stall);
        }

      if (stall > 5000)
        {
          CAM_LOG("[Cam-DVP] frame EOF timeout\n");

          /* Restore: re-arm + re-enable interrupts so the next capture can
           * retry (the EOF IRQ is still masked here).
           */

          cam_dvp_arm();
          cam_dvp_enable_ints();
          g_stream_armed = true;
          return -ETIMEDOUT;
        }
    }

  cam_dvp_putreg(cam_gdma_reg(DMA_IN_INT_CLR_CH0_REG, ch),
                 DMA_IN_SUC_EOF_CH0_INT_ST_M);

  /* 4. Freeze the DMA (it stopped at the EOF; belt & suspenders) */

  esp32s3_dma_disable(priv->dma_channel, false);
  g_stream_armed = false;

  /* Frame directly written to PSRAM by DMA: CPU invalidates cache before
   * reading (no-op for internal SRAM)
   */

  cam_dvp_sync_rxbuf();

  /* 5. Diagnostics on the RAW frame (before any swap):
   * [xxxx|yyyy r..g..b.. | r..g..b..] = pixel value as little-endian vs
   * swapped; the first RGB triplet is what LVGL shows WITHOUT swap (CORRECT
   * for OV3660), the second is what it shows WITH swap.
   */

  CAM_LOG("[Cam-DVP] frame done: %u bytes (swap=%s)\n",
         (unsigned)g_frame_size, g_cam_byte_swap ? "on" : "off");

  if (sink != NULL)
    {
      int k;
      const uint8_t *fp = g_cam_rxbuf;

      CAM_LOG("[Cam-DVP] frame head:");
      for (k = 0; k < 16; k++)
        {
          printf(" %02x", fp[k]);
        }

      printf("\n");

      cam_diag_pixels(fp, 0);
      cam_diag_pixels(fp, 320);
      cam_diag_pixels(fp, 16000);
    }

  /* Optional RGB565 byte swap (sensor sends high byte first, LVGL wants
   * little-endian), then hand the frame to the sink.
   */

  if (g_cam_byte_swap)
    {
      cam_swap_rgb565(g_cam_rxbuf, g_frame_size);
    }

  /* get_frame() must point to [this specific frame captured]. Fixed on
   * 2026-09-10: This line was originally Indentation error in
   * g_cam_byte_swap branch — once byte swap is disabled (`plant cam swap`
   * or default changed elsewhere), g_last_frame retains previous value
   * (likely for preview shadow), the caller gets the previous frame/another
   * buffer by calling get_frame(): desaturated on A, but upload read from B,
   * resulting in "changes appeared to have no effect".
   */

  g_last_frame = g_cam_rxbuf;

  if (sink != NULL)
    {
      sink(g_cam_rxbuf, g_frame_size, sink_arg);
    }

  /* 6. End [no re-arm]: DMA stops at frame boundary, rxbuf remains stable.
   * this is key for tear-free preview — if cam_dvp_arm() restarts DMA
   * here, the next frame immediately overwrites rxbuf, LVGL reads half-new
   * half-old during rendering → random stripes. The next capture start
   * will re-arm.
   */

  if (eoi_out != NULL)
    {
      *eoi_out = true;
    }

  CAM_LOG("[Cam-DVP] capture done\n");
  return (int)g_frame_size;
}

/****************************************************************************
 * Name: esp32s3_cam_dvp_diag
 *
 * Layered hardware diagnosis.  Prints the raw register state of every
 * link in the capture chain so a single call pinpoints which layer is
 * broken (camera output / GPIO routing / CAM peripheral / clock / GDMA).
 *
 * Layers:
 *   L1 camera: PCLK/VSYNC/HREF GPIO input levels (static sample)
 *   L2 CAM ctrl: cam_ctrl / cam_ctrl1 (mode, start, bytelen)
 *   L3 CAM clock: lcd_clock (clk_en, cam_clk_sel)
 *   L4 CAM int: lc_dma_int_raw (cam_vsync/hs raw bits = VSYNC arriving?)
 *   L5 GDMA: int_raw/int_st, conf0, periph sel, state, dscr
 ****************************************************************************/

void esp32s3_cam_dvp_diag(void)
{
  struct esp32s3_cam_s *priv = &g_cam;
  int ch = priv->dma_channel;
  uint32_t v;

  printf("\n===== CAM-DVP LAYER DIAG =====\n");

  printf("L0 swap: rgb565 byte swap = %s\n",
         g_cam_byte_swap ? "ON" : "OFF");

  /* L0b: frame rate (block_done delta over 1s; needs init (capture) first).
   * NOTE: vsync_count fires ~2.3x per frame (OV3660 VSYNC edges + filter),
   * use block_done (GDMA EOF = 1/frame) for the real rate.
   */

  if (priv->initialized)
    {
      uint32_t v0 = priv->block_done;

      up_udelay(1000000);
      printf("L0b frame rate: %u FPS (block_done %u -> %u, vsync %u)\n",
             priv->block_done - v0, v0, priv->block_done,
             priv->vsync_count);
    }
  else
    {
      printf("L0b frame rate: not initialized (run 'plant cam capture' "
             "once first)\n");
    }

