open-vela/nuttx/arch/xtensa/src/esp32s3/esp32s3_cam_dvp.c
  /* L1: camera GPIO levels (static; PCLK toggles fast so sample a few) */

  printf("L1 GPIO: PCLK(14)=%d HREF(41)=%d VSYNC(42)=%d "
         "D0(12)=%d D7(40)=%d\n",
         esp32s3_gpioread(14), esp32s3_gpioread(41), esp32s3_gpioread(42),
         esp32s3_gpioread(12), esp32s3_gpioread(40));

  /* PCLK toggle test: 20 samples over ~2ms - any change = clock running */

    {
      int s;
      int pclk_prev = -1;
      int pclk_changes = 0;

      for (s = 0; s < 20; s++)
        {
          int p = esp32s3_gpioread(14);

          if (pclk_prev >= 0 && p != pclk_prev)
            {
              pclk_changes++;
            }

          pclk_prev = p;
          up_udelay(100);
        }

      printf("L1 PCLK toggles in 2ms: %d/20 samples\n", pclk_changes);
    }

  /* All 8 data pins + HREF + VSYNC raw sample (sensor output check; D0-D7 =
   * Y2-Y9 = IO12,10,9,11,13,21,38,40 in bit order)
   */

  printf("L1 D0-7(12,10,9,11,13,21,38,40)=%d%d%d%d%d%d%d%d "
         "HREF=%d VSYNC=%d\n",
         esp32s3_gpioread(12), esp32s3_gpioread(10), esp32s3_gpioread(9),
         esp32s3_gpioread(11), esp32s3_gpioread(13), esp32s3_gpioread(21),
         esp32s3_gpioread(38), esp32s3_gpioread(40),
         esp32s3_gpioread(41), esp32s3_gpioread(42));

  /* L2: CAM control registers */

  v = cam_dvp_getreg(LCD_CAM_CAM_CTRL_REG);
  printf("L2 cam_ctrl  = 0x%08x (stop_en=%d vs_eof_en=%d clk_sel=%d)\n",
         v, (v >> 0) & 1, (v >> 8) & 1, (v >> 29) & 3);

  v = cam_dvp_getreg(LCD_CAM_CAM_CTRL1_REG);
  printf("L2 cam_ctrl1 = 0x%08x (start=%d 2byte=%d bytelen=%d)\n",
         v, (v >> 29) & 1, (v >> 24) & 1, v & 0xffff);

  /* L3: clock */

  v = cam_dvp_getreg(LCD_CAM_LCD_CLOCK_REG);
  printf("L3 lcd_clock = 0x%08x (clk_en=%d clk_sel=%d div_num=%d)\n",
         v, (v >> 31) & 1, (v >> 29) & 3, (v >> 9) & 0xff);

  /* L4: CAM interrupt raw (did VSYNC arrive?) */

  v = cam_dvp_getreg(LCD_CAM_LC_DMA_INT_RAW_REG);
  printf("L4 int_raw   = 0x%08x (lcd_vsync=%d cam_vsync=%d cam_hs=%d)\n",
         v, (v >> 0) & 1, (v >> 2) & 1, (v >> 3) & 1);

  /* L5: GDMA RX channel state */

  if (ch >= 0)
    {
      printf("L5 DMA chan=%d\n", ch);
      v = cam_dvp_getreg(cam_gdma_reg(DMA_IN_INT_RAW_CH0_REG, ch));
      printf("L5 in_int_raw = 0x%08x (suc_eof=%d err_eof=%d done=%d)\n",
             v, (v >> 1) & 1, (v >> 2) & 1, (v >> 0) & 1);
      v = cam_dvp_getreg(cam_gdma_reg(DMA_IN_CONF0_CH0_REG, ch));
      printf("L5 in_conf0   = 0x%08x (mem_trans_en=%d burst=%d)\n",
             v, (v >> 0) & 1, (v >> 5) & 1);
      v = cam_dvp_getreg(cam_gdma_reg(DMA_IN_PERI_SEL_CH0_REG, ch));
      printf("L5 in_peri_sel= 0x%08x (%d)\n", v, v & 0x1f);
      v = cam_dvp_getreg(cam_gdma_reg(DMA_IN_STATE_CH0_REG, ch));
      printf("L5 in_state   = 0x%08x\n", v);
      v = cam_dvp_getreg(cam_gdma_reg(DMA_IN_LINK_CH0_REG, ch));
      printf("L5 in_link    = 0x%08x (start=%d stop=%d)\n",
             v, (v >> 22) & 1, (v >> 21) & 1);
    }
  else
    {
      printf("L5 DMA chan not allocated\n");
    }

  /* L6: per-descriptor status (did DMA actually write bytes?) */

  if (priv->initialized)
    {
      int i;

      printf("L6 desc ctrl (buf_len=%d):\n", ESP32S3_DMA_CTRL_BUFLEN_V);
      for (i = 0; i < CAM_RX_DESC_NUM; i++)
        {
          uint32_t c = priv->dmadesc[i].ctrl;

          printf("L6  desc[%d] ctrl=0x%08x owner=%d eof=%d err=%d "
                 "datalen=%d\n",
                 i, c, (c >> 31) & 1, (c >> 30) & 1, (c >> 28) & 1,
                 (c >> ESP32S3_DMA_CTRL_DATALEN_S) &
                 ESP32S3_DMA_CTRL_DATALEN_V);
        }
    }
  else
    {
      printf("L6 not initialized yet\n");
    }

  printf("===== DIAG END =====\n");
}

/****************************************************************************
 * Name: esp32s3_cam_dvp_get_frame
 *
 * Return the internal DMA RX buffer (static, CAM_RX_BUF_SIZE bytes).
 * The latest captured frame lives in its first g_frame_size bytes.
 * Used by the UI to display the frame without a second buffer copy.
 ****************************************************************************/

uint8_t *esp32s3_cam_dvp_get_frame(void)
{
  return g_last_frame != NULL ? g_last_frame : g_cam_rxbuf;
}

/****************************************************************************
 * Name: esp32s3_cam_dvp_set_framesize
 *
 * Runtime frame geometry switching (preview 160x120 / capture 640x480).
 *
 * DMA chain and rxbuf/shadow are allocated with CAM_MAX_SIZE, and
 * vs_eof_en=1 makes VSYNC
 * becomes a frame boundary (EOF prematurely ends transfer), so here there is
 * no need to reconfigure the DMA chain — only change
 * CPU read-back length and write-back length. The caller is responsible for
 * switching the sensor to the same resolution first (via SCCB),
 * And ensure capture is stopped before calling (no concurrent frame
 * grabbing).
 *
 * ⚠️ Do NOT clear warmed_up here: both modes use the same sensor window
 * (start/end both 0,0→2079,1547), only output scaling differs, scene
 * average brightness unchanged
 * → AEC/AGC/AWB remains effective, no need to re-run the 40-frame warm-up
 * (otherwise, on every capture, every return
 * Preview will all wait about an extra 9 seconds). Switching timing
 * stability is handled by two inherent aspects of the freeze path.
 * Frame period alignment (see the two-step align + post-mask EOF in
 * capture).
 *
 * Input Parameters:
 * w, h - target pixel dimensions (<= CAM_MAX_W / CAM_MAX_H)
 *
 * Returned Value: 0 success; negative errno for failure
 ****************************************************************************/

int esp32s3_cam_dvp_set_framesize(uint32_t w, uint32_t h)
{
  if (w == 0 || h == 0 || w > CAM_MAX_W || h > CAM_MAX_H)
    {
      printf("[Cam-DVP] set_framesize %ux%u out of range (max %dx%d)\n",
             (unsigned)w, (unsigned)h, CAM_MAX_W, CAM_MAX_H);
      return -EINVAL;
    }

  g_frame_w = w;
  g_frame_h = h;
  g_frame_size = w * h * CAM_FRAME_BPP;

  printf("[Cam-DVP] framesize -> %ux%u (%u bytes)\n",
         (unsigned)w, (unsigned)h, (unsigned)g_frame_size);
  return OK;
}

/****************************************************************************
 * Name: esp32s3_cam_dvp_get_framesize
 ****************************************************************************/

void esp32s3_cam_dvp_get_framesize(uint32_t *w, uint32_t *h)
{
  if (w != NULL) *w = g_frame_w;
  if (h != NULL) *h = g_frame_h;
}

/****************************************************************************
 * Name: esp32s3_cam_dvp_set_swap / esp32s3_cam_dvp_get_swap
 *
 * Runtime toggle for the software RGB565 byte swap (`plant cam swap`).
 * Default ON (OV3660 0x4300=0x61 sends high byte first; LVGL wants
 * little-endian).  Flip to OFF if a capture ever shows swapped R/B.
 ****************************************************************************/

void esp32s3_cam_dvp_set_swap(bool on)
{
  g_cam_byte_swap = on;
  printf("[Cam-DVP] rgb565 byte swap %s\n", on ? "ON" : "OFF");
}

bool esp32s3_cam_dvp_get_swap(void)
{
  return g_cam_byte_swap;
}

/****************************************************************************
 * Name: esp32s3_cam_dvp_set_quiet
 *
 * Silent mode: disable capture's per-frame logging (used by the preview
 * thread, to avoid flooding the log and slowing things down).
 ****************************************************************************/

void esp32s3_cam_dvp_set_quiet(bool quiet)
{
  g_cam_quiet = quiet;
}

/****************************************************************************
 * Name: esp32s3_cam_dvp_set_stream / esp32s3_cam_dvp_get_stream
 *
 * Preview stream mode switch. When enabled, capture() follows the "rolling
 * snapshot" path: DMA continuous acquisition,
 * Frame complete then copied to shadow (no freeze, no re-arm), preview wait
 * reduced from ~2 frame periods
 * reduces to about one frame period; LCD/UI reads from shadow while DMA
 * writes to rxbuf, without mutual interference.
 * Single-frame paths like photo/color bars remain disabled (freeze mode, for
 * stable, zero-copy frames).
 ****************************************************************************/

void esp32s3_cam_dvp_set_stream(bool on)
{
  if (g_stream_mode == on)
    {
      return;
    }

  g_stream_mode = on;
  g_stream_armed = false;
  g_last_frame = on ? g_cam_shadow : g_cam_rxbuf;
  printf("[Cam-DVP] stream mode %s\n", on ? "ON (rolling snapshot)" : "OFF");
}

bool esp32s3_cam_dvp_get_stream(void)
{
  return g_stream_mode;
}
#endif /* CONFIG_ESP32S3_CAM_DVP */
